[{"bookName":"Ego and Archetype","bookAuthorName":"Edward F. Edinger","bookCategory":"Psychology","bookDescription":"A medical psychiatrist and founding member of the Jung Foundation explores a pivotal part of analytical psychology: encountering the self through individuation This book is about the individual’s journey to psychological wholeness, known in analytical psychology as the process of individuation. Edward Edinger traces the stages in this process and relates them to the search for meaning through encounters with symbolism in religion, myth, dreams, and art. For contemporary men and women, Edinger believes, the encounter with the self is equivalent to the discovery of God. The result of the dialogue between the ego and the archetypal image of God is an experience that dramatically changes the individual’s worldview and makes possible a new and more meaningful way of life.","bookCover":"http://books.google.com/books/content?id=mFpOB2GUcIEC&printsec=frontcover&img=1&zoom=1&source=gbs_api","bookId":"44286c15-6321-44c3-b5b1-cd241498e66b","bookFilePath":"/run/user/1000/doc/b44fc5fd/Edward F. Edinger - Ego and Archetype-Shambhala (1992).epub"},{"bookName":"The Crucible of Consciousness","bookAuthorName":"Zoltan Torey","bookCategory":"Philosophy","bookDescription":"An interdisciplinary examination of the evolutionary breakthroughs that rendered the brain accessible to itself. In The Crucible of Consciousness, Zoltan Torey offers a theory of the mind and its central role in evolution. He traces the evolutionary breakthrough that rendered the brain accessible to itself and shows how the mind-boosted brain works. He identifies what it is that separates the human's self-reflective consciousness from mere animal awareness, and he maps its neural and linguistic underpinnings. And he argues, controversially, that the neural technicalities of reflective awareness can be neither algorithmic nor spiritual—neither a computer nor a ghost in the machine. The human mind is unique; it is not only the epicenter of our knowledge but also the outer limit of our intellectual reach. Not to solve the riddle of the self-aware mind, writes Torey, goes against the evolutionary thrust that created it. Torey proposes a model that brings into a single focus all the elements that make up the puzzle: how the brain works, its functional components and their interactions; how language evolved and how syntax evolved out of the semantic substrate by way of neural transactions; and why the mind-endowed brain deceives itself with entelechy-type impressions. Torey first traces the language-linked emergence of the mind, the subsystem of the brain that enables it to be aware of itself. He then explores this system: how consciousness works, why it is not transparent to introspection, and what sense it makes in the context of evolution. The “consciousness revolution” and the integrative focus of neuroscience have made it possible to make concrete formerly mysterious ideas about the human mind. Torey's model of the mind is the logical outcome of this, highlighting a coherent and meaningful role for a reflectively aware humanity.","bookCover":"http://books.google.com/books/content?id=fkbyZwF5sGUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","bookId":"af7f4c4b-b1cd-4dee-ad5c-e6c65c41312e","bookFilePath":"/run/user/1000/doc/ba23bb69/Zoltan Torey, Daniel C. Dennett - The crucible of consciousness_ an integrated theory of mind and brain-MIT Press (2009).pdf"},{"bookName":"The 48 Laws of Power","bookAuthorName":"Robert Greene","bookCategory":"Control (Psychology)","bookDescription":"Cunning, instructive, and amoral, this controversial bestseller distills 3,000 years of the history of power into 48 well-explicated laws.","bookCover":"http://books.google.com/books/content?id=Py6ZPwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","bookId":"19cd61ee-81ec-4e85-b7d1-bbd6785824ce","bookFilePath":"/run/user/1000/doc/c0e5538b/Robert Greene, Joost Elffers - The 48 laws of power-Profile Books (2000).epub"},{"bookName":"C.G. Jung_ Joseph Campbell_ R.F.C. Hull - The Portable Jung-Penguin Books (1976)","bookAuthorName":"No Info","bookCategory":"No Info","bookDescription":"Problem loading book information or No Results found online!","bookCover":"","bookId":"2562bf76-e423-44a0-a003-3f7e4a16cdc3","bookFilePath":"/run/user/1000/doc/e983d329/C.G. Jung_ Joseph Campbell_ R.F.C. Hull - The Portable Jung-Penguin Books (1976).pdf"}]